# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
x = bin(10)
print(x[2:])
